===========================================
Nested identifiers
===========================================

Foo.Bar.baz

---

(source_file
  (expression_statement
    (module_nested_identifier
      (module_name)
      (module_name) (identifier))))

===========================================
Tuple
===========================================

(1, 2)

---

(source_file
  (expression_statement
    (tuple (number) (number))))

===========================================
Call
===========================================

min(1, 2)

---

(source_file
  (expression_statement
    (call_expression
      (identifier)
      (arguments
        (number)
        (number)))))

===========================================
Pipe
===========================================

foo->bar->baz
xs->Array.map(foo)->Array.sum

---

(source_file
  (expression_statement
    (pipe_expression
      (pipe_expression (identifier) (identifier))
      (identifier)))
  (expression_statement
    (pipe_expression
      (call_expression
        (pipe_expression
          (identifier)
          (module_nested_identifier (module_name) (identifier)))
        (arguments (identifier)))
      (module_nested_identifier (module_name) (identifier)))))
