===========================================
Open
===========================================

open Foo
open! Foo.Bar

---

(source_file
  (open_statement (module_identifier))
  (open_statement
    (module_identifier_path (module_identifier) (module_identifier))))

===========================================
Include
===========================================

include Foo
include Foo.Bar
include module type of Belt.Array

---

(source_file
  (include_statement (module_identifier))
  (include_statement
    (module_identifier_path (module_identifier) (module_identifier)))
  (include_statement
    (module_type_of
      (module_identifier_path (module_identifier) (module_identifier)))))

===========================================
Simple definition
===========================================

module MyModule = {
  type t
}

---

(source_file
  (module_declaration
    (module_identifier)
    (block (type_declaration (type_identifier)))))

===========================================
Signature and definition
===========================================

module MyModule: {
  let a: int
  let b: float
  let c: string
}

module MyModule: Foo.Bar = {
  type t
}

module MyModule: {
  type t
} = {
  type t = int
}

---

(source_file
  (module_declaration
    (module_identifier)
    signature: (block
      (let_binding (value_identifier) (type_annotation (type_identifier)))
      (let_binding (value_identifier) (type_annotation (type_identifier)))
      (let_binding (value_identifier) (type_annotation (type_identifier)))))
  (module_declaration
    (module_identifier)
    signature: (module_identifier_path (module_identifier) (module_identifier))
    definition: (block (type_declaration (type_identifier))))
  (module_declaration
    (module_identifier)
    signature: (block (type_declaration (type_identifier)))
    definition: (block (type_declaration (type_identifier) (type_identifier)))))

===========================================
Alias
===========================================

module Q = Foo.Bar.Qux

---

(source_file
  (module_declaration
    (module_identifier)
    (module_identifier_path
      (module_identifier_path (module_identifier) (module_identifier))
      (module_identifier))))

===========================================
Externals
===========================================

external aX: t => float = "aX"
@val external foo: int = "foo"
@bs.val external foo: int = "foo"
@module("libfoo") @new external foo: t = "Foo"
external _makeStyles: ({..}, . unit) => {..} = "makeStyles"

---

(source_file
  (external_declaration
    (value_identifier)
    (type_annotation
      (function_type
        (function_type_parameters (type_identifier))
        (type_identifier)))
    (string (string_fragment)))
  (decorated
    (decorator (decorator_identifier))
    (external_declaration
      (value_identifier)
      (type_annotation (type_identifier))
      (string (string_fragment))))
  (decorated
    (decorator (decorator_identifier))
    (external_declaration
      (value_identifier)
      (type_annotation (type_identifier))
      (string (string_fragment))))
  (decorated
    (decorator
      (decorator_identifier)
      (decorator_arguments (string (string_fragment))))
    (decorator (decorator_identifier))
    (external_declaration
      (value_identifier)
      (type_annotation (type_identifier))
      (string (string_fragment))))
  (external_declaration
    (value_identifier)
    (type_annotation
      (function_type
        (function_type_parameters
          (object_type)
          (uncurry)
          (unit_type))
        (object_type)))
    (string (string_fragment))))

===========================================
Decorators
===========================================

@@warning("-27")

---

(source_file
  (decorator_statement
    (decorator_identifier)
    (decorator_arguments (string (string_fragment)))))
