===========================================
Opaque
===========================================

type t

---

(source_file
 (type_declaration (type_identifier)))

===========================================
Alias
===========================================

type t = Foo.Bar.qux

---

(source_file
  (type_declaration
    (type_identifier)
    (nested_type_identifier
      (module_name) (module_name) (type_identifier))))

===========================================
Record
===========================================

type t = {
  a: int,
  b: myType,
}

---

(source_file
  (type_declaration
    (type_identifier)
    (record_type
      (record_type_field
        (property_identifier) (type_annotation (type_identifier)))
      (record_type_field
        (property_identifier) (type_annotation (type_identifier))))))

===========================================
Variant
===========================================

type t =
  | A
  | B(anotherType)
  | C({foo: int, bar: string})

---

(source_file
  (type_declaration
    (type_identifier)
    (variant_type
      (variant_declaration (variant_identifier))
      (variant_declaration
        (variant_identifier) (variant_parameters (type_identifier)))
      (variant_declaration
        (variant_identifier)
        (variant_parameters
          (record_type
            (record_type_field
              (property_identifier) (type_annotation (type_identifier)))
            (record_type_field
              (property_identifier) (type_annotation (type_identifier)))
            ))))))
